#include <stdio.h>

/* 指向数组的指针 */
int main()
{
    int a[10] = {1,2,3,4,5,6,7,8,9,10};
    int *p = a; // 指向第一个元素
    int (*pa)[10] = &a; // 指向整个数组
    printf("%d\n", (*pa)[0]);
    printf("%d\n", pa[0][0]);

    /* 访问数组中的r元素 */
    char b[4][3][2]=   {{{'a', 'b'}, {'c', 'd'}, {'e', 'f'}},
                        {{'g', 'h'}, {'i', 'j'}, {'k', 'l'}},
		                {{'m', 'n'}, {'o', 'p'}, {'q', 'r'}},
		                {{'s', 't'}, {'u', 'v'}, {'w', 'x'}}};
    char (*pb)[2] = &b[2][2];
    char (*ppb)[3][2] = &b[2];
    printf("%c\n",pb[0][1]);
    printf("%c\n",ppb[0][2][1]); // 注意不要写错了！

    return 0;
}